In [5]:
# merge -----> two data join -----> merging
dict1 = {
    'name':['A','B','C'],
    'age':(34,45,89)
}

In [16]:
dict2 = {
    'name':['X','Y','Z'],
    'hobby':[1,2,3]
}

In [7]:
import pandas as pd

In [17]:
df = pd.DataFrame(dict1)

In [18]:
df

  name  age
0    A   34
1    B   45
2    C   89

In [19]:
df2 = pd.DataFrame(dict2)

In [20]:
df2

  name  hobby
0    X      1
1    Y      2
2    Z      3

In [21]:
f = pd.merge(df,df2,how = 'inner')

In [22]:
f

Empty DataFrame
Columns: [name, age, hobby]
Index: []

In [ ]:
# x = df.merge(df2,how = 'outer')

In [ ]:
# x

In [23]:
pd.merge(df,df2,how = 'left')

  name  age  hobby
0    A   34    NaN
1    B   45    NaN
2    C   89    NaN

In [24]:
pd.merge(df,df2,how = 'right')

  name  age  hobby
0    X  NaN      1
1    Y  NaN      2
2    Z  NaN      3

In [25]:
pd.merge(df,df2,how='outer')

  name   age  hobby
0    A  34.0    NaN
1    B  45.0    NaN
2    C  89.0    NaN
3    X   NaN    1.0
4    Y   NaN    2.0
5    Z   NaN    3.0